0x900C5649/nrf52_boards/source/connectivity/fido_nfc.c
/******************************************************************************
 * File:             fido_nfc.c
 *
 * Author:           Joshua Steffensky <joshua.steffensky@cispa.saarland>  
 * Created:          06/18/20 
 * Description:      nfc ctap implementation
 *****************************************************************************/

#include "fido_nfc.h"
#include "fido_interfaces.h"
#include "apdu.h"
#include "ctap.h"
#include "ctap_errors.h"
#include "u2f.h"

#include "nfc_t4t_lib.h"
#include "app_util.h"
#include "mem_manager.h"
//#include "app_error.h"
//#include "nordic_common.h"

/*  LOG INIT  */
#define NRF_LOG_MODULE_NAME nfc

#include "nrf_log.h"
#include "nrf_log_ctrl.h"

NRF_LOG_MODULE_REGISTER();
/*            */


/***************************************************************************** 
 *                            local prototypes
 *****************************************************************************/

/* send response */

/** 
 * @brief		respond to nfc request with just a status
 * 
 * @param[in] 	status	status to send
 *
 * @return 		void
 */
static void nfc_send_status(uint16_t status);

/** 
 * @brief		response to nfc request with plain data. data copied to internal buffer.
 * 
 * @param[in] 	data	data to send
 * @param[in] 	len	    length of data to send
 *
 * @return 		void
 */
static void nfc_send_response_plain(uint8_t *data, size_t len);

/** 
 * @brief		respond to nfc request with data and status code. data copied to internat buffer.
 *
 * @param[in] 	data	data to send
 * @param[in] 	len	    length of data to send
 * @param[in] 	status	status to send
 * 
 * @return 		Return parameter description
 */
static void nfc_send_response(uint8_t *data, size_t len, uint16_t status);

/** 
 * @brief		respond to nfc request with raw data **DATA NOT COPIED**
 *
 * @param[in] 	data	raw data to send (**NOT COPIED OVER**)
 * @param[in] 	len	    length of data to send
 * 
 * @return 		Return parameter description
 */
static void nfc_send_response_raw(uint8_t *data, size_t len);

/** 
 * @brief		initialise response buffer if necessary and send first message
 * 
 * @param[in,out]  nfc_mod  nfc state
 * @param[in]      data     data to be send (copied to internat buffer)
 * @param[in]      len      length of data to be send
 * @param[in]      ext      whether received request was received are nfc extended buffer
 *
 * @return 		void
 */
static void nfc_response_init_chain(
    NFC_STATE *nfc_mod,
    uint8_t *  data,
    size_t     len,
    bool       ext);

/* nfc utils */

/** 
 * @brief		compare raw nfc aid (rid:pix)
 *
 * @param[in] 	aid	incoming aid
 * @param[in] 	len	lenght of aid
 * @param[in] 	const_aid	aid to compare to
 * @param[in] 	const_len	length of const_aid
 *
 * @return
 */
static int applet_cmp(uint8_t *aid, int len, uint8_t *const_aid, int const_len);

/** 
 * @brief		select applet in state
 * 
 * @param[out] 	nfc_mod	nfc state which might be changed
 * @param[in] 	aid	    aid to change to
 * @param[in] 	len	    length of aid
 *
 * @return 		1 is success, 0 otherwise
 */
static int select_applet(NFC_STATE *nfc_mod, uint8_t *aid, int len);

/** 
 * @brief		append nfc get append to a response
 * 
 * @param[out] 	data	    data to append to (at postition of end (i.e. bufferend -2))
 * @param[in] 	rest_len	length of remaining data to be send
 *
 * @return 		void
 */
static void append_get_response(uint8_t *data, size_t rest_len);

/** 
 * @brief		clean nfc_state 
 * 
 * @param[out] 	nfc_mod	    state to clean
 *
 * @return 		void
 */
static void nfc_clean(NFC_STATE *nfc_mod);

/** 
 * @brief		clean dispatch from nfc state
 * 
 * @param[out] 	nfc_mod     state to clean
 *
 * @return 		void
 */
static void nfc_clean_dispatch(NFC_STATE *nfc_mod);

/** 
 * @brief		clean response from nfc state
 * 
 * @param[out] 	nfc_mod	    state to clean
 * 
 * @return 		void
 */
static void nfc_clean_response(NFC_STATE *nfc_mod);

/* nfc msg handling */

/**
 * @brief Callback function for handling NFC events.
 */
static void nfc_callback(
    void *          context,
    nfc_t4t_event_t event,
    const uint8_t * data,
    size_t          dataLength,
    uint32_t        flags);

/** 
 * @brief		process incoming single apdu package on event
 * 
 * @param[out]  nfc_mod     nfc state that might be altered
 * @param[in]   data        raw incoming apdu command
 * @param[in]   dataLength  length of incomming data
 * @param[in]   flags       nrf sdk flags
 *
 * @return 		void
 */
static void process_apdu(
    NFC_STATE *    nfc_mod,
    const uint8_t *data,
    size_t         dataLength,
    uint32_t       flags);

/* APDU message handling (once command complete) */

/** 
 * @brief		process received and completed apdu command (main loop)
 * 
 * @param[in,out] 	nfc_mod	state whos dispatch package to process
 *
 * @return 		void
 */
static void process_dispatch(NFC_STATE *nfc_mod);

/** 
 * @brief		process get response command
 * 
 * @param[in,out] 	nfc_mod	corresponding state
 *
 * @return 		void
 */
static void apdu_get_response(NFC_STATE *nfc_mod);

/** 
 * @brief		process select applet command
 * 
 * @param[in,out] 	nfc_mod	corresponding state
 *
 * @return 		void
 */
static void apdu_select_applet(NFC_STATE *nfc_mod);

/** 
 * @brief		handle nfcctap msg
 * 
 * @param[in,out] 	nfc_mod	corresponding state
 *
 * @return 		void
 */
static void apdu_nfcctap_msg(NFC_STATE *nfc_mod);

/** 
 * @brief		handle read binary request
 * 
 * @param[in,out] 	nfc_mod	corresponding state
 *
 * @return 		void
 */
static void apdu_read_binary(NFC_STATE *nfc_mod);

/** 
 * @brief		handle u2f version request
 * 
 * @param[in,out] 	nfc_mod	corresponding state
 *
 * @return 		void
 */
static void apdu_u2f_version(NFC_STATE *nfc_mod);

/** 
 * @brief		handle u2f register request
 * 
 * @param[in,out] 	nfc_mod	corresponding state
 *
 * @return 		void
 */
static void apdu_u2f_register(NFC_STATE *nfc_mod);

/** 
 * @brief		handle u2f authenticate request
 * 
 * @param[in,out] 	nfc_mod	corresponding state
 *
 * @return 		void
 */
static void apdu_u2f_authenticate(NFC_STATE *nfc_mod);


/***************************************************************************** 
*							CONSTS
*****************************************************************************/

