0x900C5649/nrf52_boards/source/connectivity/fido_nfc.c
// Capability container
//const CAPABILITY_CONTAINER NFC_CC = {
//.cclen_hi = 0x00, .cclen_lo = 0x0f,
//.version = 0x20,
//.MLe_hi = 0x00, .MLe_lo = 0x7f,
//.MLc_hi = 0x00, .MLc_lo = 0x7f,
//.tlv = { 0x04,0x06,
//0xe1,0x04,
//0x00,0x7f,
//0x00,0x00 }
//};

const uint8_t NFC_CC[] = {
    0x00,  //CCLEN (hi, low)
    0x0f,
    0x20,  //version
    0x00,  //MLe (hi,low)
    0xff,
    0x00,  //MLc (hi,low)
    0xff,
    0x04,  //TLV
    0x06,
    0xe1,
    0x04,
    0x00,
    0x7f,
    0x00,
    0x00};

// 13 chars
const uint8_t NDEF_SAMPLE[] = "https://cispa.de/";


/***************************************************************************** 
 *                            GLOBALS
 *****************************************************************************/
NFC_STATE m_nfc;

uint8_t  txbuffer[MAX_NFC_LENGTH];
uint8_t *NFC_RECVBUF      = NULL;
size_t   NFC_RECVBUF_SIZE = 0;

/***************************************************************************** 
 *                            NFC CONTROL
 *****************************************************************************/

static void nfc_send_status(uint16_t status)
{
    nfc_send_response(NULL, 0, status);
}

static void nfc_send_response_plain(uint8_t *data, size_t len)
{
    memcpy(txbuffer, data, len);
    //    NRF_LOG_HEXDUMP_DEBUG(txbuffer, len);
    NRF_LOG_DEBUG("sending %d", len);
    nfc_send_response_raw(txbuffer, len);
}

static void nfc_send_response(uint8_t *data, size_t len, uint16_t status)
{
    NRF_LOG_DEBUG("sending response: %d", status);
    NRF_LOG_HEXDUMP_DEBUG(data, len);
    //TODO check length
    memcpy(txbuffer, data, len);

    txbuffer[len + 0] = status >> 8;
    txbuffer[len + 1] = status & 0xff;

    nfc_send_response_raw(txbuffer, len + 2);
}

static void nfc_send_response_raw(uint8_t *data, size_t len)
{
    ret_code_t err_code;
    // Send the response PDU over NFC.
    err_code = nfc_t4t_response_pdu_send(data, len);
    APP_ERROR_CHECK(err_code);
}

static void nfc_response_init_chain(
    NFC_STATE *nfc_mod,
    uint8_t *  data,
    size_t     len,
    bool       ext)
{
    if (len <= 255 || ext)
    {
        nfc_send_response_plain(data, len);
    }
    else
    {
        size_t pcklen    = MIN(253, len);
        size_t bytesleft = len - pcklen;
        NRF_LOG_INFO("61XX chaining %d/%d.", pcklen, len);

        // put the rest data into response buffer
        nfc_mod->response_buffer = nrf_malloc(bytesleft);
        nfc_mod->response_length = bytesleft;
        nfc_mod->response_offset = 0;
        memcpy(nfc_mod->response_buffer, &data[pcklen], bytesleft);

        {
            //init package
            uint8_t pck[255] = {0};
            memmove(pck, data, pcklen);
            append_get_response(&pck[pcklen], bytesleft);

            //send package
            nfc_send_response_plain(pck, pcklen + 2);  // 2 for 61XX
        }
    }
}


/***************************************************************************** 
 *                            NFC_UTILS
 *****************************************************************************/

/**  ref  solo:targets/stm32l432/nfc.c  **/
// international AID = RID:PIX
// RID length == 5 bytes
// usually aid length must be between 5 and 16 bytes
int applet_cmp(uint8_t *aid, int len, uint8_t *const_aid, int const_len)
{
    if (len > const_len)
        return 10;

    // if international AID
    if ((const_aid[0] & 0xf0) == 0xa0)
    {
        if (len < 5)
            return 11;
        return memcmp(aid, const_aid, MIN(len, const_len));
    }
    else
    {
        if (len != const_len)
            return 11;

        return memcmp(aid, const_aid, const_len);
    }
}

// Selects application.  Returns 1 if success, 0 otherwise
int select_applet(NFC_STATE *nfc_mod, uint8_t *aid, int len)
{
    if (applet_cmp(aid, len, (uint8_t *) AID_FIDO, sizeof(AID_FIDO) - 1) == 0)
    {
        nfc_mod->selected_applet = APP_FIDO;
        return APP_FIDO;
    }
    else if (
        applet_cmp(
            aid,
            len,
            (uint8_t *) AID_NDEF_TYPE_4,
            sizeof(AID_NDEF_TYPE_4) - 1)
        == 0)
    {
        nfc_mod->selected_applet = APP_NDEF_TYPE_4;
        return APP_NDEF_TYPE_4;
    }
    else if (
        applet_cmp(
            aid,
            len,
            (uint8_t *) AID_CAPABILITY_CONTAINER,
            sizeof(AID_CAPABILITY_CONTAINER) - 1)
        == 0)
    {
        nfc_mod->selected_applet = APP_CAPABILITY_CONTAINER;
        return APP_CAPABILITY_CONTAINER;
    }
    else if (
        applet_cmp(aid, len, (uint8_t *) AID_NDEF_TAG, sizeof(AID_NDEF_TAG) - 1)
        == 0)
    {
        nfc_mod->selected_applet = APP_NDEF_TAG;
        return APP_NDEF_TAG;
    }
    return APP_NOTHING;
}

static void append_get_response(uint8_t *data, size_t rest_len)
{
    data[0] = 0x61;
    data[1] = 0x00;
    if (rest_len <= 0xff)
        data[1] = rest_len & 0xff;
}
/** endref solo:targets/stm32l432/nfc. **/

static void nfc_clean(NFC_STATE *nfc_mod)
{
    nfc_mod->selected_applet = APP_NOTHING;
    nfc_clean_dispatch(nfc_mod);
    nfc_clean_response(nfc_mod);
}

static void nfc_clean_dispatch(NFC_STATE *nfc_mod)
{
    NRF_LOG_DEBUG("nfc_clean_dispatch");
    FREEANDNULL(nfc_mod->dispatch_package)
    FREEANDNULL(nfc_mod->dispatch_head)
    nfc_mod->dispatch_length = 0;
    nfc_mod->dispatch_ready  = 0;
}

static void nfc_clean_response(NFC_STATE *nfc_mod)
{
    FREEANDNULL(nfc_mod->response_buffer)
    nfc_mod->response_length = 0;
    nfc_mod->response_offset = 0;
}


/***************************************************************************** 
 *                            NFC MSG HANDLING
 *****************************************************************************/

static void nfc_callback(
    void *          context,
    nfc_t4t_event_t event,
    const uint8_t * data,
    size_t          dataLength,
    uint32_t        flags)
{
    /**ret_code_t err_code;*/
    /**uint32_t   resp_len;*/

    //    (void) context;
    /**NRF_LOG_INFO("NFC callback");*/

