0x900C5649/nrf52_boards/source/connectivity/fido_nfc.c
    switch (event)
    {
        case NFC_T4T_EVENT_FIELD_ON:
            NRF_LOG_INFO("NFC field on");

            nfc_clean((NFC_STATE *) context);
            break;

        case NFC_T4T_EVENT_FIELD_OFF: NRF_LOG_INFO("NFC field lost"); break;

        case NFC_T4T_EVENT_DATA_IND:
            if (!NFC_RECVBUF)
            {
                NFC_RECVBUF = nrf_malloc(dataLength);
            }
            else
            {
                void *newbuf = nrf_malloc(NFC_RECVBUF_SIZE + dataLength);
                memcpy(newbuf, NFC_RECVBUF, NFC_RECVBUF_SIZE);
                nrf_free(NFC_RECVBUF);
                NFC_RECVBUF = newbuf;
            }
            memcpy(NFC_RECVBUF + NFC_RECVBUF_SIZE, data, dataLength);
            NFC_RECVBUF_SIZE += dataLength;

            if (flags != NFC_T4T_DI_FLAG_MORE)
            {
                process_apdu(
                    (NFC_STATE *) context,
                    NFC_RECVBUF,
                    NFC_RECVBUF_SIZE,
                    flags);

                nrf_free(NFC_RECVBUF);
                NFC_RECVBUF      = NULL;
                NFC_RECVBUF_SIZE = 0;
            }
            break;

        case NFC_T4T_EVENT_DATA_TRANSMITTED: break;
        default: NRF_LOG_WARNING("something else happend"); break;
    }
}

static void process_apdu(
    NFC_STATE *    nfc_mod,
    const uint8_t *data,
    size_t         dataLength,
    uint32_t       flags)
{
    APDU_STRUCT *apdu = nrf_malloc(sizeof(APDU_STRUCT));
    //parse header

    NRF_LOG_DEBUG("received apdu, length: %d", dataLength);
    NRF_LOG_HEXDUMP_DEBUG(data, dataLength);
    //    NRF_LOG_FLUSH();
    memset(apdu, 0, sizeof(APDU_STRUCT));
    if (apdu_decode((uint8_t *) data, dataLength, apdu))
    {
        NRF_LOG_WARNING("apdu decode error");
        nfc_send_status(SW_INS_INVALID);
        nfc_clean(nfc_mod);
        nrf_free(apdu);
        return;
    };

    NRF_LOG_INFO(
        "apdu ok. %scase=%02x cla=%02x ins=%02x",
        apdu->extended_apdu ? "[e]" : "",
        apdu->case_type,
        apdu->cla,
        apdu->ins);
    NRF_LOG_INFO(
        "p1=%02x p2=%02x lc=%d le=%d",
        apdu->p1,
        apdu->p2,
        apdu->lc,
        apdu->le);

    if (!nfc_mod->dispatch_package)
    {
        nfc_mod->dispatch_package = nrf_malloc(CTAP_MAX_MESSAGE_SIZE);
        nfc_mod->dispatch_length  = 0;
    }
    if (nfc_mod->dispatch_length + apdu->lc > CTAP_MAX_MESSAGE_SIZE)
    {
        nfc_send_status(SW_WRONG_LENGTH);
        nfc_clean(nfc_mod);
        nrf_free(apdu);
        return;
    }
    memcpy(
        nfc_mod->dispatch_package + nfc_mod->dispatch_length,
        apdu->data,
        apdu->lc);
    nfc_mod->dispatch_length += apdu->lc;

    if (apdu->cla == 0x90 && apdu->ins == 0x10)  //chaining
    {
        nfc_send_status(SW_SUCCESS);
        nrf_free(apdu);
        return;
    }
    else
    {
        nfc_mod->dispatch_head  = apdu;
        nfc_mod->dispatch_ready = true;
    }
}


/***************************************************************************** 
 *                            APDU MSG HANDLING
 *****************************************************************************/

static void process_dispatch(NFC_STATE *nfc_mod)
{
    //check cla
    if (nfc_mod->dispatch_head->cla != 0x00
        && nfc_mod->dispatch_head->cla != 0x80)
    {
        //illegal command
        NRF_LOG_WARNING("illegal cla: 0x%x", nfc_mod->dispatch_head->cla);
        nfc_send_status(SW_CLA_INVALID);
        nfc_clean(nfc_mod);
        return;
    }

    /**  ref  original code from solo:targets/stm32l432/nfc.c  **/
    switch (nfc_mod->dispatch_head->ins)
    {
        // ISO 7816. 7.1 GET RESPONSE command
        case APDU_GET_RESPONSE: apdu_get_response(nfc_mod); break;

        case APDU_INS_SELECT: apdu_select_applet(nfc_mod); break;

        case APDU_FIDO_NFCCTAP_MSG: apdu_nfcctap_msg(nfc_mod); break;

        case APDU_INS_READ_BINARY: apdu_read_binary(nfc_mod); break;

        case APDU_FIDO_U2F_VERSION: apdu_u2f_version(nfc_mod); break;

        case APDU_FIDO_U2F_REGISTER: apdu_u2f_register(nfc_mod); break;

        case APDU_FIDO_U2F_AUTHENTICATE: apdu_u2f_authenticate(nfc_mod); break;

        default:
            NRF_LOG_WARNING("Unknown INS %02x", nfc_mod->dispatch_head->ins);
            NRF_LOG_INFO(
                "apdu: %scase=%02x cla=%02x ins=%02x",
                nfc_mod->dispatch_head->extended_apdu ? "[e]" : "",
                nfc_mod->dispatch_head->case_type,
                nfc_mod->dispatch_head->cla,
                nfc_mod->dispatch_head->ins);
            NRF_LOG_INFO(
                "p1=%02x p2=%02x lc=%d le=%d",
                nfc_mod->dispatch_head->p1,
                nfc_mod->dispatch_head->p2,
                nfc_mod->dispatch_head->lc,
                nfc_mod->dispatch_head->le);

            nfc_send_status(SW_INS_INVALID);
            nfc_clean(nfc_mod);
            break;
    }

    /** endref original code from solo:targets/stm32l432/nfc.c **/
}

static void apdu_get_response(NFC_STATE *nfc_mod)
{
    APDU_STRUCT *apdu = nfc_mod->dispatch_head;
    size_t data_left  = nfc_mod->response_length - nfc_mod->response_offset;

    if (apdu->p1 != 0x00 || apdu->p2 != 0x00)
    {
        nfc_send_status(SW_INCORRECT_P1P2);
        NRF_LOG_WARNING("P1 or P2 error");
        nfc_clean(nfc_mod);
        return;
    }

    // too many bytes needs. 0x00 and 0x100 - any length
    if (apdu->le != 0 && apdu->le != 0x100 && apdu->le > data_left)
    {
        uint16_t wlresp =
            SW_WRONG_LENGTH;  // here can be 6700, 6C00, 6FXX. but the most standard way - 67XX or 6700
        if (data_left <= 0xff)
            wlresp += data_left & 0xff;
        nfc_send_status(wlresp);
        NRF_LOG_WARNING("buffer length less than requested");
        nfc_clean_response(nfc_mod);
        return;
    }

    // create temporary packet
    uint8_t pck[255] = {0};
    size_t  pcklen   = 253;
    if (apdu->le && apdu->le != 0x100)
        pcklen = apdu->le;
    if (pcklen > data_left)
        pcklen = data_left;

    NRF_LOG_INFO("GET RESPONSE. sending %d/%d bytes left", pcklen, data_left);

    // create packet and add 61XX there if we have another portion(s) of data
    memmove(pck, nfc_mod->response_buffer + nfc_mod->response_offset, pcklen);
    size_t dlen = 0;
    if (data_left - pcklen)
    {
        append_get_response(&pck[pcklen], data_left - pcklen);
        dlen = 2;
    }

    // send
    nfc_send_response_plain(pck, pcklen + dlen);  //dlen for 61XX

    // shift the buffer
    nfc_mod->response_offset += pcklen;

    if (nfc_mod->response_offset == nfc_mod->response_length)
        nfc_clean_response(nfc_mod);
}

static void apdu_select_applet(NFC_STATE *nfc_mod)
{
    APDU_STRUCT *apdu     = nfc_mod->dispatch_head;
    int          selected = select_applet(
        nfc_mod,
        nfc_mod->dispatch_package,
        nfc_mod->dispatch_length);
    if (selected == APP_FIDO)
    {
        /**nfc_send_response((uint8_t *) "FIDO_2_0", 8, SW_SUCCESS);*/
        nfc_send_response((uint8_t *) "U2F_V2", 6, SW_SUCCESS);
        NRF_LOG_INFO("FIDO applet selected");
    }
    else if (selected != APP_NOTHING)
    {
        nfc_send_status(SW_SUCCESS);
        NRF_LOG_INFO("SELECTED %d", selected);
    }
    else
    {
        nfc_send_status(SW_FILE_NOT_FOUND);
        NRF_LOG_INFO("NOT selected");
        NRF_LOG_HEXDUMP_DEBUG(apdu->data, apdu->lc);
    }
}

static void apdu_nfcctap_msg(NFC_STATE *nfc_mod)
{
    CTAP_RESPONSE ctap_resp;
    APDU_STRUCT * apdu = nfc_mod->dispatch_head;
    uint8_t       status;

    if (nfc_mod->selected_applet != APP_FIDO)
    {
        nfc_send_status(SW_INS_INVALID);
        nfc_clean(nfc_mod);
        return;
    }

    NRF_LOG_INFO("FIDO2 CTAP message");

    // WTX_on(WTX_TIME_DEFAULT);
    //    request_from_nfc(true);
    set_req_origin(REQ_ORIGIN_NFC);

