0x900C5649/nrf52_boards/source/connectivity/fido_nfc.c
    ctap_response_init(&ctap_resp);
    status = ctap_request(
        nfc_mod->dispatch_package,
        nfc_mod->dispatch_length,
        &ctap_resp);

    set_req_origin(REQ_ORIGIN_NONE);
    //    request_from_nfc(false);
    // if (!WTX_off())
    //     return;

    NRF_LOG_INFO("CTAP resp: 0x%02x  len: %d", status, ctap_resp.length);

    if (status == CTAP1_ERR_SUCCESS)
    {
        memmove(&ctap_resp.data[1], &ctap_resp.data[0], ctap_resp.length);
        ctap_resp.length += 3;
    }
    else
    {
        ctap_resp.length = 3;
    }
    ctap_resp.data[0]                    = status;
    ctap_resp.data[ctap_resp.length - 2] = SW_SUCCESS >> 8;
    ctap_resp.data[ctap_resp.length - 1] = SW_SUCCESS & 0xff;

    /**if (status == CTAP1_ERR_SUCCESS)*/
    /**{*/
    /**nfc_mod->dispatch_buffer = nrf_malloc(ctap_resp.length + 3);*/
    /**memmove(*/
    /**&nfc_mod->dispatch_buffer[1],*/
    /**&ctap_resp.data[0],*/
    /**ctap_resp.length);*/
    /**ctap_resp.length += 3;*/
    /**}*/
    /**else*/
    /**{*/
    /**nfc_mod->dispatch_buffer = nrf_malloc(3);*/
    /**ctap_resp.length         = 3;*/
    /**}*/

    /**nfc_mod->dispatch_buffer[0]     = status;*/
    /**nfc_mod->[ctap_resp.length - 2] = SW_SUCCESS >> 8;*/
    /**nfc_mod->[ctap_resp.length - 1] = SW_SUCCESS & 0xff;*/

    /**nfc_mod->response_offset = 0;*/
    /**nfc_mod->response_len    = ctap_resp.length;*/
    /**ctap_resp.data[0]                    = status;*/
    /**ctap_resp.data[ctap_resp.length - 2] = SW_SUCCESS >> 8;*/
    /**ctap_resp.data[ctap_resp.length - 1] = SW_SUCCESS & 0xff;*/

    //    nfc_write_response_chaining(buf0, ctap_resp.data, ctap_resp.length, apdu->extended_apdu);
    nfc_response_init_chain(
        nfc_mod,
        ctap_resp.data,
        ctap_resp.length,
        apdu->extended_apdu);
    NRF_LOG_INFO("CTAP answered");
}

static void apdu_read_binary(NFC_STATE *nfc_mod)
{
    APDU_STRUCT *apdu = nfc_mod->dispatch_head;
    // response length
    size_t reslen = apdu->le & 0xffff;
    switch (nfc_mod->selected_applet)
    {
        case APP_CAPABILITY_CONTAINER:
            NRF_LOG_INFO("APP_CAPABILITY_CONTAINER");
            if (reslen == 0 || reslen > sizeof(NFC_CC))
                reslen = sizeof(NFC_CC);

            nfc_send_response((uint8_t *) &NFC_CC, reslen, SW_SUCCESS);
            //            ams_wait_for_tx(10);
            break;
        case APP_NDEF_TAG:
            NRF_LOG_INFO("APP_NDEF_TAG");
            if (reslen == 0 || reslen > sizeof(NDEF_SAMPLE) - 1)
                reslen = sizeof(NDEF_SAMPLE) - 1;
            nfc_send_response((uint8_t *) NDEF_SAMPLE, reslen, SW_SUCCESS);
            //            ams_wait_for_tx(10);
            break;
        default:
            nfc_send_status(SW_FILE_NOT_FOUND);
            NRF_LOG_WARNING("No binary applet selected!");
            return;
            break;
    }
}

static void apdu_u2f_version(NFC_STATE *nfc_mod)
{
    CTAP_RESPONSE ctap_resp;
    APDU_STRUCT * apdu = nfc_mod->dispatch_head;

    if (nfc_mod->selected_applet != APP_FIDO)
    {
        nfc_send_status(SW_INS_INVALID);
        nfc_clean(nfc_mod);
        return;
    }

    NRF_LOG_INFO("U2F GetVersion command");

    u2f_request_nfc(
        (uint8_t *) apdu,
        (uint8_t *) nfc_mod->dispatch_package,
        (int) nfc_mod->dispatch_length,
        &ctap_resp);
    nfc_response_init_chain(
        nfc_mod,
        ctap_resp.data,
        ctap_resp.length,
        apdu->extended_apdu);
}

static void apdu_u2f_register(NFC_STATE *nfc_mod)
{
    APDU_STRUCT * apdu = nfc_mod->dispatch_head;
    CTAP_RESPONSE ctap_resp;

    if (nfc_mod->selected_applet != APP_FIDO)
    {
        nfc_send_status(SW_INS_INVALID);
        nfc_clean(nfc_mod);
        return;
    }

    NRF_LOG_INFO("U2F Register command.");

    if (apdu->lc != 64)
    {
        NRF_LOG_INFO("U2F Register request length error. len=%d", apdu->lc);
        nfc_send_status(SW_WRONG_LENGTH);
        return;
    }

    /**timestamp();*/


    // WTX_on(WTX_TIME_DEFAULT);
    // SystemClock_Config_LF32();
    // delay(300);
    /**if (device_is_nfc() == NFC_IS_ACTIVE)*/
    /**device_set_clock_rate(DEVICE_LOW_POWER_FAST);*/

    /**u2f_request_nfc(apduptr, apdu->data, apdu->lc, &ctap_resp);*/
    u2f_request_nfc(
        (uint8_t *) apdu,
        (uint8_t *) nfc_mod->dispatch_package,
        (int) nfc_mod->dispatch_length,
        &ctap_resp);

    /**if (device_is_nfc() == NFC_IS_ACTIVE)*/
    /**device_set_clock_rate(DEVICE_LOW_POWER_IDLE);*/
    // if (!WTX_off())
    // 	return;

    nfc_response_init_chain(
        nfc_mod,
        ctap_resp.data,
        ctap_resp.length,
        apdu->extended_apdu);
}

static void apdu_u2f_authenticate(NFC_STATE *nfc_mod)
{
    APDU_STRUCT * apdu = nfc_mod->dispatch_head;
    CTAP_RESPONSE ctap_resp;

    if (nfc_mod->selected_applet != APP_FIDO)
    {
        nfc_send_status(SW_INS_INVALID);
        nfc_clean(nfc_mod);
        return;
    }

    NRF_LOG_INFO("U2F Authenticate command.");

    if (apdu->lc != 64 + 1 + apdu->data[64])
    {
        //delay(5);
        NRF_LOG_INFO(
            "U2F Authenticate request length error. len=%d keyhlen=%d.",
            apdu->lc,
            apdu->data[64]);
        nfc_send_status(SW_WRONG_LENGTH);
        return;
    }

    //    timestamp();
    // WTX_on(WTX_TIME_DEFAULT);
    u2f_request_nfc(
        (uint8_t *) apdu,
        (uint8_t *) nfc_mod->dispatch_package,
        (int) nfc_mod->dispatch_length,
        &ctap_resp);
    /**u2f_request_nfc(apduptr, apdu->data, apdu->lc, &ctap_resp);*/
    // if (!WTX_off())
    // 	return;

    NRF_LOG_INFO("U2F resp len: %d", ctap_resp.length);
    NRF_LOG_HEXDUMP_DEBUG(ctap_resp.data, ctap_resp.length);
    nfc_response_init_chain(
        nfc_mod,
        ctap_resp.data,
        ctap_resp.length,
        apdu->extended_apdu);
}

/***************************************************************************** 
 *                            public interface
 *****************************************************************************/

void nfc_init(void)
{
    NRF_LOG_INFO("initializing nfc");
    ret_code_t err_code;
    //INIT NFC STATE
    nfc_clean(&m_nfc);

    //INIT LIBRARY
    err_code = nfc_t4t_setup(nfc_callback, &m_nfc);
    APP_ERROR_CHECK(err_code);

    //start emulation
    err_code = nfc_t4t_emulation_start();
    APP_ERROR_CHECK(err_code);
}

void nfc_process(void)
{
    if (m_nfc.dispatch_ready)
    {
        process_dispatch(&m_nfc);
        nfc_clean_dispatch(&m_nfc);
    }
}
